In [1]:
import pandas as pd, requests
from bs4 import BeautifulSoup

In [2]:
# url = 'https://waterdata.usgs.gov/wa/nwis/uv?cb_all_=on&cb_00060=on&cb_00065=on&format=rdb&site_no=12194000&period=&begin_date=2020-01-31&end_date=2020-02-16'

# res = requests.get(url)

# res.status_code

# con_soup = BeautifulSoup(res.content, 'html')

# con_table_body = con_soup.find('body')
# waters = []
# for row in con_table_body.find('pre')
#     water = {}
#     water['date/time'] = row.find('td').text
#     water['discharge'] = row.find('span').text
#     water['gauge_h'] = row.find_all('span').text
#     waters.append(water)

#     print(water)
# con_df = pd.DataFrame(waters)

# con_table_body.save('concrete.txt')

In [3]:
# with open('con.txt', 'r') as f:
#     text = f.readlines()

In [4]:
con = pd.read_csv('Text_files/con_2.txt', sep = '\t')
mv = pd.read_csv('Text_files/mv_2.txt', sep = '\t')

In [5]:
con.head()

,agency_cd,city,datetime,timezone,discharge,151437_00060_cd,gauge_lvl,151438_00065_cd
0,USGS,12194000,2007-10-01 00:00,PDT,8140,A:[91],NaN,NaN
1,USGS,12194000,2007-10-01 00:15,PDT,8170,A:[91],NaN,NaN
2,USGS,12194000,2007-10-01 00:30,PDT,8270,A:[91],NaN,NaN
3,USGS,12194000,2007-10-01 00:45,PDT,8270,A:[91],NaN,NaN
4,USGS,12194000,2007-10-01 01:00,PDT,8350,A:[0],15.87,A

In [6]:
con.dtypes

agency_cd           object
city                 int64
datetime            object
timezone            object
discharge            int64
151437_00060_cd     object
gauge_lvl          float64
151438_00065_cd     object
dtype: object

In [7]:
con.shape

(568656, 8)

In [8]:
mv.head()

,agency_cd,city,datetime,timezone,discharge,151445_00060_cd,gauge_lvl,151446_00065_cd
0,USGS,12200500,2007-10-01 00:00,PDT,8000.0,A:[91],NaN,NaN
1,USGS,12200500,2007-10-01 00:15,PDT,8000.0,A:[91],NaN,NaN
2,USGS,12200500,2007-10-01 00:30,PDT,7980.0,A:[91],NaN,NaN
3,USGS,12200500,2007-10-01 00:45,PDT,8000.0,A:[91],NaN,NaN
4,USGS,12200500,2007-10-01 01:00,PDT,7980.0,A,12.63,A

In [9]:
mv.dtypes

agency_cd           object
city                 int64
datetime            object
timezone            object
discharge          float64
151445_00060_cd     object
gauge_lvl          float64
151446_00065_cd     object
dtype: object

In [10]:
mv.shape

(431145, 8)

In [11]:
con = con.drop(['agency_cd', '151437_00060_cd', '151438_00065_cd'], axis = 1)

In [12]:
con.head()

       city          datetime timezone  discharge  gauge_lvl
0  12194000  2007-10-01 00:00      PDT       8140        NaN
1  12194000  2007-10-01 00:15      PDT       8170        NaN
2  12194000  2007-10-01 00:30      PDT       8270        NaN
3  12194000  2007-10-01 00:45      PDT       8270        NaN
4  12194000  2007-10-01 01:00      PDT       8350      15.87

In [13]:
con['city'] = con['city'].replace(12194000, 'Concrete')

In [14]:
con = con.dropna()

In [15]:
con.head()

       city          datetime timezone  discharge  gauge_lvl
4  Concrete  2007-10-01 01:00      PDT       8350      15.87
5  Concrete  2007-10-01 01:15      PDT       8320      15.86
6  Concrete  2007-10-01 01:30      PDT       8350      15.87
7  Concrete  2007-10-01 01:45      PDT       8370      15.88
8  Concrete  2007-10-01 02:00      PDT       8450      15.91

In [16]:
con.shape

(568652, 5)

In [17]:
mv = mv.drop(['agency_cd', '151445_00060_cd', '151446_00065_cd'], axis = 1)

In [18]:
mv.head()

       city          datetime timezone  discharge  gauge_lvl
0  12200500  2007-10-01 00:00      PDT     8000.0        NaN
1  12200500  2007-10-01 00:15      PDT     8000.0        NaN
2  12200500  2007-10-01 00:30      PDT     7980.0        NaN
3  12200500  2007-10-01 00:45      PDT     8000.0        NaN
4  12200500  2007-10-01 01:00      PDT     7980.0      12.63

In [19]:
mv['city'] = mv['city'].replace(12200500, 'Mount Vernon')

In [20]:
mv.head()

           city          datetime timezone  discharge  gauge_lvl
0  Mount Vernon  2007-10-01 00:00      PDT     8000.0        NaN
1  Mount Vernon  2007-10-01 00:15      PDT     8000.0        NaN
2  Mount Vernon  2007-10-01 00:30      PDT     7980.0        NaN
3  Mount Vernon  2007-10-01 00:45      PDT     8000.0        NaN
4  Mount Vernon  2007-10-01 01:00      PDT     7980.0      12.63

In [21]:
mv = mv.dropna()

In [22]:
mv.head()

           city          datetime timezone  discharge  gauge_lvl
4  Mount Vernon  2007-10-01 01:00      PDT     7980.0      12.63
5  Mount Vernon  2007-10-01 01:15      PDT     8000.0      12.64
6  Mount Vernon  2007-10-01 01:30      PDT     8020.0      12.65
7  Mount Vernon  2007-10-01 01:45      PDT     8060.0      12.66
8  Mount Vernon  2007-10-01 02:00      PDT     8090.0      12.68

In [23]:
mv.shape

(431091, 5)

In [24]:
mv.to_csv('Datasets/mount_vernon.csv', index = False)

In [25]:
con.to_csv('Datasets/concrete.csv', index = False)